using System;

namespace _3._2
{
    class Program
    {
        static void Main()
        {
        }
    }
}

// Написать хеш-таблицу в виде класса с использованием класса-списка из первой задачи.Должно быть можно добавлять значение в хеш-таблицу, удалять и проверять на принадлежность
// Модифицировать хеш-таблицу из задачи 2 предыдущей работы так, чтобы хеш-функцию можно было менять в зависимости от выбора пользователя, 
// причём хеш-функцию должно быть можно передавать из использующего хеш-таблицу кода в виде объекта некоторого класса, 
// реализующего некоторый интерфейс. Юнит-тесты и коментарии в формате XML Documentation обязательны.